import React, { useState } from 'react';
import './Citatebi.css';
import { Link } from 'react-router-dom';
interface ITitle {
    title: string;
    paragraph: string[];
}
const chapters =  [
    { title: "სხვა სხვისა ომსა ბრძენია.", paragraph:[`სხვის ომში ყველას თავი ბრძენი ჰგონია - ამ გამონათქვამით გადმოცემულია ის იდეა, რომ ადამიანი, რომელიც უშუალოდ არ მონაწილეობს რთულ ვითარებაში (მაგალითად, ომში), ადვილად ასრულებს მორალურ ან გონებრივ განსჯას, თითქოს ყველაფერს უკეთესად იაზრებს და აკონტროლებს.`]},
    {title:"გონიერთა მწვრთელი უყვარს, უგუნურთა გულსა ჰგმირდეს.", paragraph:[`ეს პოეტური გამონათქვამი ამბობს, რომ გონიერი (ჭკვიანი) ადამიანი აფასებს და სიხარულით იღებს თავის წინამძღოლებსა და გამრჩევლებს, რადგან მათგან სიბრძნე და სწავლა მიიღება. ხოლო უგუნური (არაპარტული ან უყურადღებო) ადამიანი, პირიქით, გულში აღგზნებასა და უარყოფით ემოციებს განიცდის.

ეს სიტყვები ცდილობს აჩვენოს, რომ გონიერი ადამიანი თავს აყენებს ისეთ ადამიანებთან, ვინც უკეთესობას, სწავლებას და ზრდას უზრუნველყოფენ, ხოლო უგუნური პიროვნება ვერ ხედავს და არ აფასებს ამ მნიშვნელობას, რის გამოც მისი გული უკმაყოფილებითაა აღვსილი.

მნიშვნელობა შეიძლება იყოს ისეთი: ჭკვიანმა ადამიანს უხარია სწავლა და განვითარება, მაშინ როცა უგუნურს არ შეუძლია ეს არ შეიგრძნოს.`]},
{title:'ვჰგმობ მუხთალსა საწუთროსა, ზოგჯერ უხვსა, ზოგჯერ ძვირსა.', paragraph:[`ეს გამონათქვამი გადმოსცემს იდეას, რომ ადამიანს, რომელიც რაღაც საქმის მიმართ მიდრეკილია, შეუძლია შეაფასოს მისი ღირებულება ან მდგომარეობა, როგორც დროებით და არა მუდმივად. „მუხთალი საწუთრო“ შეიძლება უკავშირდებოდეს სხვადასხვა სიტუაციებს, რომელშიც რა თქმა უნდა, ზოგჯერ ან სიხარული, ან ტკივილი ან ნაკლები მოლოდინი ემთხვევა.

„ზოგჯერ უხვსა, ზოგჯერ ძვირსა“ ნიშნავს იმას, რომ ადამიანის შეხედულება შეიძლება შეიცვალოს, რადგან სიტუაციის ან ამოცანის შეფასება დამოკიდებულია მის შინაგან მდგომარეობაზე და დროულ მორგებაზე.

ამით შეიძლება იყოს გამოხატული იდეა, რომ არ არსებობს მუდმივი ღირებულება, ყველაფერი ცვალებადია და დამოკიდებულია იმაზე, თუ როგორ უყურებს ადამიანი გარკვეულ სიტუაციებს.`]},
{title:"კაცი არ ყველა სწორია, დიდი ძეს კაცით კაცამდის.", paragraph:[`ეს გამონათქვამი გადმოსცემს აზრს, რომ ადამიანები სხვადასხვა არიან, ხოლო ყოველი ადამიანი შეიძლება განსხვავდებოდეს სხვებისგან არა მხოლოდ პიროვნული თვისებებით, არამედ აზროვნების, შეხედულებებისა და იდეების მხრივაც. „კაცი არ ყველა სწორია“ მოიცავს იმ ფაქტს, რომ ადამიანს შეიძლება არ ჰქონდეს აბსოლუტური სიმართლე, რადგან რაც ერთი ადამიანისათვის სწორია, შესაძლოა სხვა ადამიანისთვის არ იყოს სწორი.

„დიდი ძე კაცით კაცამდის“ კიდევ უფრო გვამცნობს, რომ ეს განსხვავებები გადადის არა მხოლოდ თაობებს შორის, არამედ პიროვნებათა ურთიერთობებში, რადგან დიდების ან ჭეშმარიტების ცნებები ხშირად ადამიანის პერსპექტივაზე და გამოცდილებებზე დამოკიდებულია.

ეს გამონათქვამი ამბობს, რომ ადამიანთა შეხედულებები და აზრები შეიძლება განსხვავდებოდეს ერთმანეთისგან, მაგრამ ამავე დროს ყველას აქვს თავისი სიმართლე და პოზიცია.`]},
{title:"მით დიაცსა სამალავი არას თანა არ ეთხრობის.", paragraph:[`ამ გამონათქვამით გადმოსულია ის აზრი, რომ დიასახლისის (ან ქალის) პირადი საიდუმლოებები, გრძნობები ან პრობლემები არ უნდა გახდეს საჯარო და ყველასთვის ხელმისაწვდომი. „სამალავი არას“ აღნიშნავს, რომ რაღაც პირადი ან ინტიმური არასოდეს უნდა გახდეს ცნობილი სხვებისთვის. „ეთხრობის“ კი იმაშია, რომ ადამიანი არ უნდა ლაპარაკობდეს ან არ უნდა გასცდეს გარშემომყოფებს თავისი პირადი ცხოვრების და გრძნობების შესახებ.

ეს გამონათქვამი ხაზს უსვამს პირადობის დაცვის მნიშვნელობას და მიუთითებს, რომ ადამიანმა უნდა იცოდეს, რა უნდა გააზიაროს და რა უნდა ინარჩუნოს მხოლოდ საკუთარ თავში.`]}
]
const CitatebiBox: React.FC<ITitle> = ({ title, paragraph }) => {
    const [isOpen, setIsOpen] = useState(false);
    const [isNoteOpen, setIsNoteOpen] = useState(false);
    const [note, setNote] = useState<string>('');

    const toggleDivs = () => {
        setIsOpen(!isOpen);
    };

    const toggleNoteSection = () => {
        setIsNoteOpen(!isNoteOpen);
    };

    const handleSaveNote = () => {
        localStorage.setItem(`note-${title}`, note);
        setIsNoteOpen(false);
    };

    return (
        <div className="periphrazed-box">
            <div className="periphrazed-box-header">
                <h3 className="periphrazed-box-title">
                    <strong>{title}</strong>
                </h3>
                <button className="periphrazed-box-button" onClick={toggleDivs}>
                    {isOpen ? 'დახურე' : 'გაიაზრე'}
                </button>
            </div>
            {isOpen && (
                <div className="periphrazed-expanded-container">
                    <div className="periphrazed-expanded-content">
                        {paragraph.map((chunk, index) => (
                            <p key={index}>{chunk}</p>
                        ))}
                    </div>

                    <div className="periphrazed-box-note">
                        <button className="periphrazed-box-button" onClick={toggleNoteSection}>
                            {isNoteOpen ? 'დახურე' : 'დამატე ჩანაწერი'}
                        </button>
                    </div>

                    {isNoteOpen && (
                        <div className="note-container">
                            <textarea
                                value={note}
                                onChange={(e) => setNote(e.target.value)}
                                placeholder="ჩაინიშნეთ ფიქრნი..."
                            />
                            <button onClick={handleSaveNote}>შენახვა</button>
                        </div>
                    )}
                </div>
            )}
        </div>
    );
};

const Citatebi: React.FC = () => {
    return (
        <>
            <div className="periphrazed-title-container">
                <h1 className="periphrazed-title">აფორიზმები</h1>
            </div>
            {chapters.map((chapter, index) => (
                <CitatebiBox key={index} title={chapter.title} paragraph={chapter.paragraph} />
            ))}
             <div className="back-link">
                    <Link to="/ნაწარმოებანი">უკან დაბრუნება</Link>
                  </div>
        </>
    );
};

export default Citatebi;
